module.exports = {
	// يمكنك تعديل اللغة هنا أو مباشرة داخل ملفات الأحداث
	autoUpdateThreadInfo: {},
	checkwarn: {
		text: {
			warn: "العضو %1 وصل لـ 3 تحذيرات وتم إزالته من المجموعة.\n- الاسم: %1\n- آيدي المستخدم: %2\n- لاستعادة الوصول، استخدم الأمر: %3warn unban <uid>",
			needPermission: "البوت يحتاج صلاحية إدمن لإزالة هذا العضو."
		}
	},
	leave: {
		text: {
			session1: "الصباح",
			session2: "الظهر",
			session3: "العصر",
			session4: "المساء",
			leaveType1: "غادر المجموعة",
			leaveType2: "تم إزالته من المجموعة"
		}
	},
	logsbot: {
		text: {
			title: "====== سجلات البوت ======",
			added: "\n✅\nالحدث: تمت إضافة البوت لمجموعة جديدة\n- تمت الإضافة بواسطة: %1",
			kicked: "\n❌\nالحدث: تم طرد البوت\n- تم الطرد بواسطة: %1",
			footer: "\n- آيدي المستخدم: %1\n- المجموعة: %2\n- آيدي المجموعة: %3\n- الوقت: %4"
		}
	},
	onEvent: {},
	welcome: {
		text: {
			session1: "الصباح",
			session2: "الظهر",
			session3: "العصر",
			session4: "المساء",
			welcomeMessage: "شكرًا لإضافتي للمجموعة.\nبادئة البوت: %1\nاستخدم %1help لرؤية الأوامر المتاحة.",
			multiple1: "أنت",
			multiple2: "أنتم"
		}
	}
};
