module.exports = {
	// يمكنك تعديل اللغة هنا أو مباشرة داخل ملفات الأوامر
	onlyadminbox: {
		description: "تفعيل/تعطيل وضع استخدام البوت لمشرفي المجموعة فقط",
		guide: "   {pn} [on | off]",
		text: {
			turnedOn: "تم تفعيل وضع استخدام البوت من قبل مشرفي المجموعة فقط",
			turnedOff: "تم إيقاف وضع استخدام البوت من قبل مشرفي المجموعة فقط",
			syntaxError: "صيغة خاطئة، استخدم فقط {pn} on أو {pn} off"
		}
	},
	adduser: {
		description: "إضافة عضو إلى محادثتك",
		guide: "   {pn} [رابط البروفايل | آيدي المستخدم]",
		text: {
			alreadyInGroup: "موجود بالفعل في المجموعة",
			successAdd: "- تم إضافة %1 عضو إلى المجموعة بنجاح",
			failedAdd: "- فشلت إضافة %1 عضو إلى المجموعة",
			approve: "- تمت إضافة %1 عضو إلى قائمة الموافقة",
			invalidLink: "من فضلك أدخل رابط فيسبوك صحيح",
			cannotGetUid: "تعذر الحصول على آيدي هذا المستخدم",
			linkNotExist: "رابط البروفايل هذا غير موجود",
			cannotAddUser: "البوت محظور أو أن هذا المستخدم منع الغرباء من إضافته للمجموعة"
		}
	},
	admin: {
		description: "إضافة، إزالة، تعديل صلاحية الإدمن",
		guide: "   {pn} [add | -a] <uid>: إضافة صلاحية إدمن للمستخدم\n\t  {pn} [remove | -r] <uid>: إزالة صلاحية إدمن من المستخدم\n\t  {pn} [list | -l]: عرض كل الإدمنز",
		text: {
			added: "✅ | تمت إضافة صلاحية إدمن لـ %1 مستخدم:\n%2",
			alreadyAdmin: "\n⚠️ | %1 مستخدم لديهم بالفعل صلاحية إدمن:\n%2",
			missingIdAdd: "⚠️ | من فضلك أدخل آيدي المستخدم أو اعمل تاج له لإضافة صلاحية إدمن",
			removed: "✅ | تمت إزالة صلاحية إدمن من %1 مستخدم:\n%2",
			notAdmin: "⚠️ | %1 مستخدم ليس لديهم صلاحية إدمن:\n%2",
			missingIdRemove: "⚠️ | من فضلك أدخل آيدي المستخدم أو اعمل تاج له لإزالة صلاحية إدمن",
			listAdmin: "👑 | قائمة الإدمنز:\n%1"
		}
	},
	adminonly: {
		description: "تفعيل/تعطيل وضع استخدام البوت للإدمن فقط",
		guide: "{pn} [on | off]",
		text: {
			turnedOn: "تم تفعيل وضع استخدام البوت للإدمن فقط",
			turnedOff: "تم إيقاف وضع استخدام البوت للإدمن فقط",
			syntaxError: "صيغة خاطئة، استخدم فقط {pn} on أو {pn} off"
		}
	},
	all: {
		description: "عمل تاج لكل أعضاء المجموعة",
		guide: "{pn} [محتوى | فارغ]"
	},
	anime: {
		description: "صورة أنمي عشوائية",
		guide: "{pn} <endpoint>\n   قائمة الـ endpoint: neko, kitsune, hug, pat, waifu, cry, kiss, slap, smug, punch",
		text: {
			loading: "جاري تجهيز الصورة، من فضلك انتظر...",
			error: "حدث خطأ، من فضلك حاول مرة أخرى لاحقًا"
		}
	},
	antichangeinfobox: {
		description: "تفعيل/تعطيل منع تغيير معلومات المحادثة",
		guide: "   {pn} avt [on | off]: منع تغيير صورة المحادثة\n   {pn} name [on | off]: منع تغيير اسم المحادثة\n   {pn} theme [on | off]: منع تغيير ثيم المحادثة\n   {pn} emoji [on | off]: منع تغيير إيموجي المحادثة",
		text: {
			antiChangeAvatarOn: "تم تفعيل منع تغيير صورة المحادثة",
			antiChangeAvatarOff: "تم إيقاف منع تغيير صورة المحادثة",
			missingAvt: "لم تقم بتعيين صورة للمحادثة",
			antiChangeNameOn: "تم تفعيل منع تغيير اسم المحادثة",
			antiChangeNameOff: "تم إيقاف منع تغيير اسم المحادثة",
			antiChangeThemeOn: "تم تفعيل منع تغيير ثيم المحادثة",
			antiChangeThemeOff: "تم إيقاف منع تغيير ثيم المحادثة",
			antiChangeEmojiOn: "تم تفعيل منع تغيير إيموجي المحادثة",
			antiChangeEmojiOff: "تم إيقاف منع تغيير إيموجي المحادثة",
			antiChangeAvatarAlreadyOn: "منع تغيير صورة المحادثة مفعّل بالفعل",
			antiChangeNameAlreadyOn: "منع تغيير اسم المحادثة مفعّل بالفعل",
			antiChangeThemeAlreadyOn: "منع تغيير ثيم المحادثة مفعّل بالفعل",
			antiChangeEmojiAlreadyOn: "منع تغيير إيموجي المحادثة مفعّل بالفعل"
		}
	},
	appstore: {
		description: "البحث عن تطبيق على الـ App Store",
		text: {
			missingKeyword: "لم تقم بإدخال أي كلمة بحث",
			noResult: "لا توجد نتائج للكلمة %1"
		}
	},
	autosetname: {
		description: "تغيير الاسم المستعار للعضو الجديد تلقائيًا",
		guide: "   {pn} set <الاسم المستعار>: لضبط إعدادات تغيير الاسم تلقائيًا، مع بعض الاختصارات:\n   + {userName}: اسم العضو الجديد\n   + {userID}: آيدي العضو\n   مثال:\n    {pn} set {userName} 🚀\n\n   {pn} [on | off]: لتفعيل/تعطيل هذه الميزة\n\n   {pn} [view | info]: عرض الإعدادات الحالية",
		text: {
			missingConfig: "من فضلك أدخل الإعدادات المطلوبة",
			configSuccess: "تم ضبط الإعدادات بنجاح",
			currentConfig: "الإعدادات الحالية لـ autoSetName في مجموعتك هي:\n%1",
			notSetConfig: "مجموعتك لم تقم بضبط إعدادات autoSetName",
			syntaxError: "صيغة خاطئة، يمكن استخدام \"{pn} on\" أو \"{pn} off\" فقط",
			turnOnSuccess: "تم تفعيل ميزة autoSetName",
			turnOffSuccess: "تم إيقاف ميزة autoSetName",
			error: "حدث خطأ أثناء استخدام ميزة autoSetName، جرّب إيقاف ميزة رابط الدعوة في المجموعة وحاول مرة أخرى لاحقًا"
		}
	},
	avatar: {
		description: "إنشاء صورة أنمي شخصية بتوقيع",
		guide: "{p}{n} <آيدي أو اسم الشخصية> | <نص الخلفية> | <التوقيع> | <اسم اللون أو كود اللون hex>\n{p}{n} help: عرض طريقة استخدام الأمر",
		text: {
			initImage: "جاري تجهيز الصورة، من فضلك انتظر...",
			invalidCharacter: "يوجد حاليًا فقط %1 شخصية في النظام، من فضلك أدخل آيدي شخصية أقل من",
			notFoundCharacter: "لم يتم العثور على شخصية بالاسم %1 في قائمة الشخصيات",
			errorGetCharacter: "حدث خطأ أثناء جلب بيانات الشخصية:\n%1: %2",
			success: "✅ صورتك الشخصية\nالشخصية: %1\nالآيدي: %2\nنص الخلفية: %3\nالتوقيع: %4\nاللون: %5",
			defaultColor: "افتراضي",
			error: "حدث خطأ\n%1: %2"
		}
	},
	badwords: {
		description: "تفعيل/تعطيل/إضافة/إزالة تحذير الكلمات الممنوعة، إذا خالف عضو سيتم تحذيره، والمرة الثانية سيتم طرده من المحادثة",
		guide: "   {pn} add <كلمات>: إضافة كلمات ممنوعة (يمكنك إضافة أكثر من كلمة مفصولة بفاصلة \",\" أو خط رأسي \"|\")\n   {pn} delete <كلمات>: حذف كلمات ممنوعة (يمكنك حذف أكثر من كلمة مفصولة بفاصلة \",\" أو خط رأسي \"|\")\n   {pn} list <hide | اتركه فارغًا>: عرض القائمة (أضف \"hide\" لإخفاء الكلمات الممنوعة)\n   {pn} unwarn [<آيدي المستخدم> | <@تاج>]: إزالة تحذير واحد من عضو\n   {pn} on: إيقاف التحذير\n   {pn} off: تفعيل التحذير",
		text: {
			onText: "مفعّل",
			offText: "معطّل",
			onlyAdmin: "⚠️ | فقط الإدمنز يمكنهم إضافة كلمات ممنوعة للقائمة",
			missingWords: "⚠️ | لم تقم بإدخال الكلمات الممنوعة",
			addedSuccess: "✅ | تمت إضافة %1 كلمة ممنوعة للقائمة",
			alreadyExist: "❌ | %1 كلمة ممنوعة موجودة بالفعل في القائمة من قبل: %2",
			tooShort: "⚠️ | لا يمكن إضافة %1 كلمة ممنوعة للقائمة لأنها أقصر من حرفين: %2",
			onlyAdmin2: "⚠️ | فقط الإدمنز يمكنهم حذف كلمات ممنوعة من القائمة",
			missingWords2: "⚠️ | لم تقم بإدخال الكلمات المراد حذفها",
			deletedSuccess: "✅ | تم حذف %1 كلمة ممنوعة من القائمة",
			notExist: "❌ | %1 كلمة ممنوعة غير موجودة في القائمة من قبل: %2",
			emptyList: "⚠️ | قائمة الكلمات الممنوعة في مجموعتك فارغة حاليًا",
			badWordsList: "📑 | قائمة الكلمات الممنوعة في مجموعتك: %1",
			onlyAdmin3: "⚠️ | فقط الإدمنز يمكنهم %1 هذه الميزة",
			turnedOnOrOff: "✅ | تم %1 تحذير الكلمات الممنوعة",
			onlyAdmin4: "⚠️ | فقط الإدمنز يمكنهم حذف تحذير الكلمات الممنوعة",
			missingTarget: "⚠️ | لم تقم بإدخال آيدي المستخدم أو عمل تاج له",
			notWarned: "⚠️ | المستخدم %1 لم يتم تحذيره بخصوص الكلمات الممنوعة",
			removedWarn: "✅ | تمت إزالة تحذير كلمة ممنوعة واحد من المستخدم %1 | %2",
			warned: "⚠️ | تم رصد كلمات ممنوعة \"%1\" في رسالتك، إذا استمريت في المخالفة سيتم طردك من المجموعة.",
			warned2: "⚠️ | تم رصد كلمات ممنوعة \"%1\" في رسالتك، لقد خالفت مرتين وسيتم طردك من المجموعة.",
			needAdmin: "البوت يحتاج صلاحيات إدمن لطرد الأعضاء المحظورين",
			unwarned: "✅ | تمت إزالة تحذير الكلمات الممنوعة من المستخدم %1 | %2"
		}
	},
	balance: {
		description: "عرض رصيدك أو رصيد الشخص الذي عملت له تاج",
		guide: "   {pn}: عرض رصيدك\n   {pn} <@تاج>: عرض رصيد الشخص الذي عملت له تاج",
		text: {
			money: "لديك %1$",
			moneyOf: "لدى %1 مبلغ %2$"
		}
	},
	batslap: {
		description: "صورة صفعة الوطواط",
		text: {
			noTag: "يجب عليك عمل تاج للشخص الذي تريد صفعه"
		}
	},
	busy: {
		description: "تفعيل وضع عدم الإزعاج، عند عمل تاج لك سيقوم البوت بالتنبيه",
		guide: "   {pn} [فارغ | <السبب>]: تفعيل وضع عدم الإزعاج\n   {pn} off: إيقاف وضع عدم الإزعاج",
		text: {
			turnedOff: "✅ | تم إيقاف وضع عدم الإزعاج",
			turnedOn: "✅ | تم تفعيل وضع عدم الإزعاج",
			turnedOnWithReason: "✅ | تم تفعيل وضع عدم الإزعاج بالسبب: %1",
			alreadyOn: "المستخدم %1 مشغول حاليًا",
			alreadyOnWithReason: "المستخدم %1 مشغول حاليًا بالسبب: %2"
		}
	},
	callad: {
		description: "إرسال بلاغ، ملاحظات، مشكلة تقنية،... إلى إدمن البوت",
		guide: "   {pn} <الرسالة>",
		text: {
			missingMessage: "من فضلك أدخل الرسالة التي تريد إرسالها للإدمن",
			sendByGroup: "\n- تم الإرسال من المجموعة: %1\n- آيدي المحادثة: %2",
			sendByUser: "\n- تم الإرسال من مستخدم",
			content: "\n\nالمحتوى:\n─────────────────\n%1\n─────────────────\nرد على هذه الرسالة لإرسال رسالة للمستخدم",
			success: "تم إرسال رسالتك للإدمن بنجاح!",
			reply: "📍 رد من الإدمن %1:\n─────────────────\n%2\n─────────────────\nرد على هذه الرسالة لمواصلة إرسال رسالة للإدمن",
			replySuccess: "تم إرسال ردك للإدمن بنجاح!",
			feedback: "📝 ملاحظات من المستخدم %1:\n- آيدي المستخدم: %2%3\n\nالمحتوى:\n─────────────────\n%4\n─────────────────\nرد على هذه الرسالة لإرسال رسالة للمستخدم",
			replyUserSuccess: "تم إرسال ردك للمستخدم بنجاح!"
		}
	},
	cmd: {
		description: "إدارة ملفات الأوامر الخاصة بك",
		guide: "{pn} load <اسم ملف الأمر>\n{pn} loadAll\n{pn} install <الرابط> <اسم ملف الأمر>: تحميل وتثبيت ملف أمر من رابط، الرابط هو مسار الملف (raw)",
		text: {
			missingFileName: "⚠️ | من فضلك أدخل اسم الأمر الذي تريد إعادة تحميله",
			loaded: "✅ | تم تحميل الأمر \"%1\" بنجاح",
			loadedError: "❌ | فشل تحميل الأمر \"%1\" بسبب الخطأ\n%2: %3",
			loadedSuccess: "✅ | تم تحميل الأمر \"%1\" بنجاح",
			loadedFail: "❌ | فشل تحميل الأمر \"%1\"\n%2",
			missingCommandNameUnload: "⚠️ | من فضلك أدخل اسم الأمر الذي تريد إلغاء تحميله",
			unloaded: "✅ | تم إلغاء تحميل الأمر \"%1\" بنجاح",
			unloadedError: "❌ | فشل إلغاء تحميل الأمر \"%1\" بسبب الخطأ\n%2: %3",
			missingUrlCodeOrFileName: "⚠️ | من فضلك أدخل الرابط أو الكود واسم ملف الأمر الذي تريد تثبيته",
			missingUrlOrCode: "⚠️ | من فضلك أدخل الرابط أو كود ملف الأمر الذي تريد تثبيته",
			missingFileNameInstall: "⚠️ | من فضلك أدخل اسم الملف لحفظ الأمر (بامتداد .js)",
			invalidUrlOrCode: "⚠️ | تعذر الحصول على كود الأمر",
			alreadExist: "⚠️ | ملف الأمر موجود بالفعل، هل أنت متأكد أنك تريد استبدال ملف الأمر القديم؟\nتفاعل مع هذه الرسالة للمتابعة",
			installed: "✅ | تم تثبيت الأمر \"%1\" بنجاح، تم حفظ ملف الأمر في %2",
			installedError: "❌ | فشل تثبيت الأمر \"%1\" بسبب الخطأ\n%2: %3",
			missingFile: "⚠️ | ملف الأمر \"%1\" غير موجود",
			invalidFileName: "⚠️ | اسم ملف الأمر غير صحيح",
			unloadedFile: "✅ | تم إلغاء تحميل الأمر \"%1\""
		}
	},
	count: {
		description: "عرض عدد رسائل كل الأعضاء أو رسائلك أنت (منذ انضمام البوت للمجموعة)",
		guide: "   {pn}: لعرض عدد رسائلك\n   {pn} @تاج: لعرض عدد رسائل من عملت لهم تاج\n   {pn} all: لعرض عدد رسائل كل الأعضاء",
		text: {
			count: "عدد رسائل الأعضاء:",
			endMessage: "الأعضاء غير الموجودين في القائمة لم يرسلوا أي رسائل.",
			page: "صفحة [%1/%2]",
			reply: "رد على هذه الرسالة برقم الصفحة لعرض المزيد",
			result: "%1 في المرتبة %2 بعدد %3 رسالة",
			yourResult: "أنت في المرتبة %1 وقد أرسلت %2 رسالة في هذه المجموعة",
			invalidPage: "رقم الصفحة غير صحيح"
		}
	},
	customrankcard: {
		description: "صمّم بطاقة الرانك بنفسك",
		guide: {
			body: "   {pn} [maincolor | subcolor | linecolor | progresscolor | alphasubcolor | textcolor | namecolor | expcolor | rankcolor | levelcolor | reset] <القيمة>"
				+ "\n   حيث: "
				+ "\n  + maincolor | background <القيمة>: الخلفية الرئيسية لبطاقة الرانك"
				+ "\n  + subcolor <القيمة>: الخلفية الفرعية"
				+ "\n  + linecolor <القيمة>: لون الخط الفاصل بين الخلفية الرئيسية والفرعية"
				+ "\n  + expbarcolor <القيمة>: لون شريط الخبرة"
				+ "\n  + progresscolor <القيمة>: لون شريط الخبرة الحالي"
				+ "\n  + alphasubcolor <القيمة>: شفافية الخلفية الفرعية (من 0 إلى 1)"
				+ "\n  + textcolor <القيمة>: لون النص (كود hex أو rgba)"
				+ "\n  + namecolor <القيمة>: لون الاسم"
				+ "\n  + expcolor <القيمة>: لون الخبرة"
				+ "\n  + rankcolor <القيمة>: لون الرانك"
				+ "\n  + levelcolor <القيمة>: لون المستوى"
				+ "\n    • يمكن أن تكون <القيمة> كود hex أو rgb أو rgba أو تدرج لوني (كل لون مفصول بمسافة) أو رابط صورة"
				+ "\n    • إذا أردت استخدام التدرج اللوني، أدخل عدة ألوان مفصولة بمسافة"
				+ "\n   {pn} reset: إعادة كل شيء للوضع الافتراضي"
				+ "\n   مثال:"
				+ "\n    {pn} maincolor #fff000"
				+ "\n    {pn} subcolor rgba(255,136,86,0.4)"
				+ "\n    {pn} reset",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/customrankcard_1.jpg`]: "https://i.ibb.co/BZ2Qgs1/image.png",
				[`${process.cwd()}/scripts/cmds/assets/guide/customrankcard_2.png`]: "https://i.ibb.co/wy1ZHHL/image.png"
			}
		},
		text: {
			invalidImage: "رابط الصورة غير صحيح، من فضلك اختر رابطًا بامتداد صورة (jpg, jpeg, png, gif)، يمكنك رفع الصورة على https://imgbb.com/ واختيار \"get direct link\" للحصول على رابط الصورة",
			invalidAttachment: "المرفق غير صحيح، من فضلك اختر ملف صورة",
			invalidColor: "كود اللون غير صحيح، من فضلك اختر كود hex (6 أرقام) أو كود rgba",
			notSupportImage: "رابط الصورة غير مدعوم مع الخيار \"%1\"",
			success: "تم حفظ تعديلاتك، إليك معاينة",
			reseted: "تمت إعادة كل الإعدادات للوضع الافتراضي",
			invalidAlpha: "من فضلك اختر رقمًا من 0 إلى 1"
		}
	},
	dhbc: {
		description: "لعبة تخمين الكلمة",
		guide: "{pn}",
		text: {
			reply: "من فضلك رد على هذه الرسالة بالإجابة\n%1",
			isSong: "هذه أغنية للمغني %1",
			notPlayer: "⚠️ أنت لست لاعب هذا السؤال",
			correct: "🎉 مبروك، إجابتك صحيحة وحصلت على %1$",
			wrong: "⚠️ إجابتك خاطئة"
		}
	},
	emojimix: {
		description: "دمج إيموجيين مع بعض",
		guide: "   {pn} <إيموجي1> <إيموجي2>\n   مثال:  {pn} 🤣 🥰"
	},
	eval: {
		description: "اختبار الكود بسرعة",
		guide: "{pn} <الكود المراد اختباره>",
		text: {
			error: "❌ حدث خطأ:"
		}
	},
	event: {
		description: "إدارة ملفات أوامر الأحداث الخاصة بك",
		guide: "{pn} load <اسم ملف الأمر>\n{pn} loadAll\n{pn} install <الرابط> <اسم ملف الأمر>: تحميل وتفعيل أمر حدث، الرابط هو مسار ملف الأمر (raw)",
		text: {
			missingFileName: "⚠️ | من فضلك أدخل اسم الأمر الذي تريد إعادة تحميله",
			loaded: "✅ | تم تحميل أمر الحدث \"%1\" بنجاح",
			loadedError: "❌ | فشل تحميل أمر الحدث \"%1\" بسبب الخطأ\n%2: %3",
			loadedSuccess: "✅ | تم تحميل أمر الحدث \"%1\" بنجاح",
			loadedFail: "❌ | فشل تحميل أمر الحدث \"%1\"\n%2",
			missingCommandNameUnload: "⚠️ | من فضلك أدخل اسم الأمر الذي تريد إلغاء تحميله",
			unloaded: "✅ | تم إلغاء تحميل أمر الحدث \"%1\" بنجاح",
			unloadedError: "❌ | فشل إلغاء تحميل أمر الحدث \"%1\" بسبب الخطأ\n%2: %3",
			missingUrlCodeOrFileName: "⚠️ | من فضلك أدخل الرابط أو الكود واسم ملف الأمر الذي تريد تثبيته",
			missingUrlOrCode: "⚠️ | من فضلك أدخل الرابط أو كود ملف الأمر الذي تريد تثبيته",
			missingFileNameInstall: "⚠️ | من فضلك أدخل اسم الملف لحفظ الأمر (بامتداد .js)",
			invalidUrlOrCode: "⚠️ | تعذر الحصول على كود الأمر",
			alreadExist: "⚠️ | ملف الأمر موجود بالفعل، هل أنت متأكد أنك تريد استبدال ملف الأمر القديم؟\nتفاعل مع هذه الرسالة للمتابعة",
			installed: "✅ | تم تثبيت أمر الحدث \"%1\" بنجاح، تم حفظ ملف الأمر في %2",
			installedError: "❌ | فشل تثبيت أمر الحدث \"%1\" بسبب الخطأ\n%2: %3",
			missingFile: "⚠️ | الملف \"%1\" غير موجود",
			invalidFileName: "⚠️ | اسم الملف غير صحيح",
			unloadedFile: "✅ | تم إلغاء تحميل الأمر \"%1\""
		}
	},
	filteruser: {
		description: "فلترة أعضاء المجموعة حسب عدد الرسائل أو الحسابات المقفلة",
		guide: "   {pn} [<عدد الرسائل> | die]",
		text: {
			needAdmin: "⚠️ | من فضلك اجعل البوت إدمن في المجموعة لاستخدام هذا الأمر",
			confirm: "⚠️ | هل أنت متأكد أنك تريد حذف أعضاء المجموعة الذين لديهم أقل من %1 رسالة؟\nتفاعل مع هذه الرسالة للتأكيد",
			kickByBlock: "✅ | تم حذف %1 عضو من أصحاب الحسابات المقفلة بنجاح",
			kickByMsg: "✅ | تم حذف %1 عضو لديهم أقل من %2 رسالة بنجاح",
			kickError: "❌ | حدث خطأ ولم يتم طرد %1 عضو:\n%2",
			noBlock: "✅ | لا يوجد أعضاء لديهم حسابات مقفلة",
			noMsg: "✅ | لا يوجد أعضاء لديهم أقل من %1 رسالة"
		}
	},
	getfbstate: {
		description: "الحصول على fbstate الحالي",
		guide: "{pn}",
		text: {
			success: "تم إرسال fbstate لك، من فضلك تحقق من رسائل البوت الخاصة"
		}
	},
	grouptag: {
		description: "عمل تاج للأعضاء حسب المجموعة",
		guide: "   {pn} add <اسم مجموعة التاج> <@تاجات>: لإضافة مجموعة تاج جديدة أو إضافة أعضاء لمجموعة تاج\n   مثال:\n    {pn} TEAM1 @تاج1 @تاج2\n\n   {pn} del <اسم مجموعة التاج> <@تاجات>: لإزالة أعضاء من مجموعة تاج\n   مثال:\n    {pn} del TEAM1 @تاج1 @تاج2\n\n   {pn} remove <اسم مجموعة التاج>: لحذف مجموعة تاج\n   مثال:\n    {pn} remove TEAM1\n\n   {pn} rename <اسم مجموعة التاج> | <الاسم الجديد>: لإعادة تسمية مجموعة تاج\n\n   {pn} [list | all]: لعرض قائمة مجموعات التاج في مجموعتك\n\n   {pn} info <اسم مجموعة التاج>: لعرض معلومات مجموعة تاج",
		text: {
			noGroupTagName: "من فضلك أدخل اسم مجموعة التاج",
			noMention: "لم تقم بعمل تاج لأي عضو لإضافته لمجموعة التاج",
			addedSuccess: "تمت إضافة الأعضاء:\n%1\nإلى مجموعة التاج \"%2\"",
			addedSuccess2: "تمت إضافة مجموعة التاج \"%1\" بالأعضاء:\n%2",
			existedInGroupTag: "الأعضاء:\n%1\nموجودون بالفعل في مجموعة التاج \"%2\"",
			notExistedInGroupTag: "الأعضاء:\n%1\nغير موجودين في مجموعة التاج \"%2\"",
			noExistedGroupTag: "مجموعة التاج \"%1\" غير موجودة في مجموعتك",
			noExistedGroupTag2: "مجموعتك لم تقم بإضافة أي مجموعة تاج",
			noMentionDel: "من فضلك اعمل تاج للأعضاء المراد إزالتهم من مجموعة التاج \"%1\"",
			deletedSuccess: "تم حذف الأعضاء:\n%1\nمن مجموعة التاج \"%2\"",
			deletedSuccess2: "تم حذف مجموعة التاج \"%1\"",
			tagged: "تاج مجموعة \"%1\":\n%2",
			noGroupTagName2: "من فضلك أدخل اسم مجموعة التاج القديم والجديد مفصولين بـ \"|\"",
			renamedSuccess: "تم تغيير اسم مجموعة التاج \"%1\" إلى \"%2\"",
			infoGroupTag: "📑 | اسم المجموعة: \"%1\"\n👥 | عدد الأعضاء: %2\n👨‍👩‍👧‍👦 | قائمة الأعضاء:\n %3"
		}
	},
	help: {
		description: "عرض طريقة استخدام الأوامر",
		guide: "{pn} [فارغ | <رقم الصفحة> | <اسم الأمر>]",
		text: {
			help: "الأوامر:\n%1\nصفحة %2/%3 • الإجمالي: %4\n- استخدم %5help <رقم الصفحة> لعرض القائمة\n- استخدم %5help <اسم الأمر> لمزيد من التفاصيل\n%6",
			help2: "%1الإجمالي: %2\n- استخدم %3help <اسم الأمر> لمزيد من التفاصيل\n%4",
			commandNotFound: "الأمر \"%1\" غير موجود",
			getInfoCommand: "الاسم: %1\nالوصف: %2\nالأسماء البديلة: %3\nأسماء بديلة للمجموعة: %4\nالإصدار: %5\nالصلاحية: %6\nفترة الانتظار: %7 ثانية\nالمطور: %8\n\nطريقة الاستخدام:\n%9\n\nملاحظات:\n- <> = مطلوب، [] = اختر واحدًا",
			doNotHave: "لا يوجد",
			roleText0: "0 (كل المستخدمين)",
			roleText1: "1 (مشرفو المجموعة)",
			roleText2: "2 (إدمن البوت)",
			roleText0setRole: "0 (تحديد صلاحية، كل المستخدمين)",
			roleText1setRole: "1 (تحديد صلاحية، مشرفو المجموعة)",
			pageNotFound: "الصفحة %1 غير موجودة"
		}
	},
	kick: {
		description: "طرد عضو من المحادثة",
		guide: "{pn} @تاجات: لطرد الأعضاء الذين تم عمل تاج لهم"
	},
	loadconfig: {
		description: "إعادة تحميل إعدادات البوت"
	},
	moon: {
		description: "عرض صورة القمر في الليلة التي تختارها (يوم/شهر/سنة)",
		guide: "  {pn} <يوم/شهر/سنة>\n   {pn} <يوم/شهر/سنة> <عنوان>",
		text: {
			invalidDateFormat: "من فضلك أدخل تاريخًا صحيحًا بصيغة يوم/شهر/سنة",
			error: "حدث خطأ أثناء جلب صورة القمر لـ %1",
			invalidDate: "%1 ليس تاريخًا صحيحًا",
			caption: "- صورة القمر في %1"
		}
	},
	notification: {
		description: "إرسال إشعار من الإدمن لكل المحادثات",
		guide: "{pn} <الرسالة>",
		text: {
			missingMessage: "من فضلك أدخل الرسالة التي تريد إرسالها لكل المجموعات",
			notification: "إشعار من إدمن البوت لكل مجموعات المحادثة (لا ترد على هذه الرسالة)",
			sendingNotification: "بدء إرسال الإشعار من إدمن البوت إلى %1 مجموعة محادثة",
			sentNotification: "✅ تم إرسال الإشعار إلى %1 مجموعة بنجاح",
			errorSendingNotification: "حدث خطأ أثناء الإرسال إلى %1 مجموعة:\n %2"
		}
	},
	prefix: {
		description: "تغيير بادئة الأوامر للبوت في محادثتك أو في النظام كله (للإدمن فقط)",
		guide: "   {pn} <البادئة الجديدة>: تغيير البادئة الجديدة في محادثتك\n   مثال:\n    {pn} #\n\n   {pn} <البادئة الجديدة> -g: تغيير البادئة في نظام البوت بالكامل (للإدمن فقط)\n   مثال:\n    {pn} # -g\n\n   {pn} reset: إعادة بادئة محادثتك للوضع الافتراضي",
		text: {
			reset: "تمت إعادة بادئتك للوضع الافتراضي: %1",
			onlyAdmin: "فقط الإدمن يمكنه تغيير بادئة نظام البوت",
			confirmGlobal: "من فضلك تفاعل مع هذه الرسالة لتأكيد تغيير بادئة نظام البوت",
			confirmThisThread: "من فضلك تفاعل مع هذه الرسالة لتأكيد تغيير البادئة في محادثتك",
			successGlobal: "تم تغيير بادئة نظام البوت إلى: %1",
			successThisThread: "تم تغيير البادئة في محادثتك إلى: %1",
			myPrefix: "🌐 بادئة النظام: %1\n🛸 بادئة محادثتك: %2"
		}
	},
	rank: {
		description: "عرض مستواك أو مستوى الشخص الذي عملت له تاج. يمكنك عمل تاج لعدة أشخاص"
	},
	rankup: {
		description: "تفعيل/تعطيل إشعار الترقية بالمستوى",
		guide: "{pn} [on | off]",
		text: {
			syntaxError: "صيغة خاطئة، استخدم فقط {pn} on أو {pn} off",
			turnedOn: "تم تفعيل إشعار الترقية بالمستوى",
			turnedOff: "تم إيقاف إشعار الترقية بالمستوى",
			notiMessage: "🎉🎉 مبروك وصولك للمستوى %1"
		}
	},
	refresh: {
		description: "تحديث معلومات المحادثة أو المستخدم",
		guide: "   {pn} [thread | group]: تحديث معلومات محادثتك\n   {pn} group <آيدي المحادثة>: تحديث معلومات محادثة بالآيدي\n\n   {pn} user: تحديث معلوماتك أنت\n   {pn} user [<آيدي المستخدم> | @تاج]: تحديث معلومات مستخدم بالآيدي",
		text: {
			refreshMyThreadSuccess: "✅ | تم تحديث معلومات محادثتك بنجاح!",
			refreshThreadTargetSuccess: "✅ | تم تحديث معلومات المحادثة %1 بنجاح!"
		}
	},
	rules: {
		description: "إنشاء/عرض/إضافة/تعديل/تغيير ترتيب/حذف قوانين مجموعتك",
		guide: "   {pn} [add | -a] <القانون المراد إضافته>: إضافة قانون للمجموعة.\n   {pn}: عرض قوانين المجموعة.\n   {pn} [edit | -e] <n> <المحتوى بعد التعديل>: تعديل القانون رقم n.\n   {pn} [move | -m] <رقم1> <رقم2>: تبديل ترتيب القانون رقم <رقم1> و <رقم2>.\n   {pn} [delete | -d] <n>: حذف القانون رقم n.\n   {pn} [remove | -r]: حذف كل قوانين المجموعة.\n\n   مثال:\n    {pn} add ممنوع السبام\n    {pn} move 1 3\n    {pn} -e 1 ممنوع إرسال رسائل سبام في المجموعة\n    {pn} -r"
	},
	sendnoti: {
		description: "إنشاء وإرسال إشعار للمجموعات التي تديرها",
		guide: "   {pn} create <اسم المجموعة>: إنشاء مجموعة إشعارات جديدة باسم <اسم المجموعة>\n   مثال:\n    {pn} create TEAM1\n\n   {pn} add <اسم المجموعة>: إضافة المحادثة الحالية لمجموعة الإشعارات <اسم المجموعة> (يجب أن تكون إدمن في هذه المحادثة)\n   مثال:\n    {pn} add TEAM1\n\n   {pn} delete: إزالة المحادثة الحالية من مجموعة الإشعارات <اسم المجموعة> (يجب أن تكون منشئ هذه المجموعة)\n   مثال:\n    {pn} delete TEAM1\n\n   {pn} send <اسم المجموعة> | <الرسالة>: إرسال إشعار لكل المجموعات في مجموعة الإشعارات <اسم المجموعة> (يجب أن تكون إدمن في تلك المجموعات)\n   مثال:\n    {pn} remove TEAM1\n\n   {pn} remove <اسم المجموعة>: إزالة مجموعة الإشعارات <اسم المجموعة> (يجب أن تكون منشئ مجموعة الإشعارات <اسم المجموعة>)\n   مثال:\n    {pn} remove TEAM1",
		text: {
			missingGroupName: "من فضلك أدخل اسم مجموعة الإشعارات",
			groupNameExists: "مجموعة الإشعارات بالاسم %1 تم إنشاؤها بواسطتك من قبل، من فضلك اختر اسمًا آخر",
			createdGroup: "تم إنشاء مجموعة الإشعارات بنجاح:\n- الاسم: %1\n- الآيدي: %2",
			missingGroupNameToAdd: "من فضلك أدخل اسم مجموعة الإشعارات التي تريد إضافة هذه المحادثة إليها",
			groupNameNotExists: "لم تقم بإنشاء/إدارة أي مجموعة إشعارات باسم: %1",
			notAdmin: "أنت لست إدمن في هذه المحادثة",
			added: "تمت إضافة المحادثة الحالية لمجموعة الإشعارات: %1",
			missingGroupNameToDelete: "من فضلك أدخل اسم مجموعة الإشعارات التي تريد حذف هذه المحادثة منها",
			notInGroup: "المحادثة الحالية ليست ضمن مجموعة الإشعارات %1",
			deleted: "تم حذف المحادثة الحالية من مجموعة الإشعارات: %1",
			failed: "فشل إرسال الإشعار إلى %1 محادثة: \n%2",
			missingGroupNameToRemove: "من فضلك أدخل اسم مجموعة الإشعارات التي تريد إزالتها",
			removed: "تمت إزالة مجموعة الإشعارات: %1",
			missingGroupNameToSend: "من فضلك أدخل اسم مجموعة الإشعارات التي تريد إرسال الرسالة إليها",
			groupIsEmpty: "مجموعة الإشعارات \"%1\" فارغة",
			sending: "جاري إرسال الإشعار إلى %1 محادثة",
			success: "تم إرسال الإشعار إلى %1 محادثة في مجموعة الإشعارات \"%2\" بنجاح",
			notAdminOfGroup: "أنت لست إدمن في هذه المجموعة",
			missingGroupNameToView: "من فضلك أدخل اسم مجموعة الإشعارات التي تريد عرض معلوماتها",
			groupInfo: "- اسم المجموعة: %1\n - الآيدي: %2\n - تاريخ الإنشاء: %3\n%4 ",
			groupInfoHasGroup: "- تحتوي على المحادثات: \n%1",
			noGroup: "لم تقم بإنشاء/إدارة أي مجموعة إشعارات"
		}
	},
	setalias: {
		description: "إضافة اسم بديل لأي أمر في مجموعتك",
		guide: "  هذا الأمر يُستخدم لإضافة/إزالة اسم بديل لأي أمر في مجموعتك\n   {pn} add <الاسم البديل> <الأمر>: إضافة اسم بديل للأمر في مجموعتك\n   {pn} add <الاسم البديل> <الأمر> -g: إضافة اسم بديل للأمر في النظام بالكامل (لإدمن البوت فقط)\nمثال:\n    {pn} add ctrk customrankcard\n\n   {pn} [remove | rm] <الاسم البديل> <الأمر>: إزالة اسم بديل للأمر في مجموعتك\n   {pn} [remove | rm] <الاسم البديل> <الأمر> -g: إزالة اسم بديل للأمر في النظام بالكامل (لإدمن البوت فقط)\nمثال:\n    {pn} rm ctrk customrankcard\n\n   {pn} list: عرض كل الأسماء البديلة للأوامر في مجموعتك\n   {pn} list -g: عرض كل الأسماء البديلة للأوامر في النظام بالكامل"
	},
	setavt: {
		description: "تغيير صورة البوت",
		text: {
			cannotGetImage: "❌ | حدث خطأ أثناء الاستعلام عن رابط الصورة",
			invalidImageFormat: "❌ | صيغة الصورة غير صحيحة",
			changedAvatar: "✅ | تم تغيير صورة البوت بنجاح"
		}
	},
	setlang: {
		description: "تحديد اللغة الافتراضية للبوت للمحادثة الحالية أو كل المحادثات",
		guide: "   {pn} <كود اللغة ISO 639-1>\n   مثال:    {pn} ar    {pn} en    {pn} vi",
		text: {
			setLangForAll: "تم تحديد اللغة الافتراضية لكل المحادثات: %1",
			setLangForCurrent: "تم تحديد اللغة الافتراضية للمحادثة الحالية: %1",
			noPermission: "فقط إدمن البوت يمكنه استخدام هذا الأمر"
		}
	},
	setleave: {
		description: "تعديل محتوى/تفعيل/تعطيل رسالة المغادرة عند خروج عضو من مجموعتك",
		guide: {
			body: "   {pn} on: تفعيل رسالة المغادرة\n   {pn} off: إيقاف رسالة المغادرة\n   {pn} text [<المحتوى> | reset]: تعديل النص أو إعادته للوضع الافتراضي، الاختصارات المتاحة:\n  + {userName}: اسم العضو الذي غادر\n  + {userNameTag}: اسم العضو الذي غادر (كتاج)\n  + {boxName}: اسم المحادثة\n  + {type}: غادر/تم طرده من إدمن\n  + {session}: فترة اليوم\n\n   مثال:\n    {pn} text {userName} قد {type} المجموعة، نراك مرة أخرى 🤧\n\n   رد على رسالة أو أرسل رسالة بملف مع المحتوى {pn} file: لإضافة مرفق لرسالة المغادرة (صورة، فيديو، صوت)\n\nمثال:\n   {pn} file reset: إعادة الملف للوضع الافتراضي",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/setleave/setleave_en_1.png`]: "https://i.ibb.co/2FKJHJr/guide1.png"
			}
		},
		text: {
			missingContent: "من فضلك أدخل المحتوى",
			edited: "تم تعديل محتوى رسالة المغادرة لمجموعتك إلى:\n%1",
			reseted: "تمت إعادة محتوى رسالة المغادرة للوضع الافتراضي",
			noFile: "لا يوجد مرفق لرسالة المغادرة لإعادته",
			resetedFile: "تمت إعادة مرفق رسالة المغادرة بنجاح",
			missingFile: "من فضلك رد على هذه الرسالة بملف صورة/فيديو/صوت",
			addedFile: "تمت إضافة %1 مرفق لرسالة المغادرة الخاصة بك"
		}
	},
	setname: {
		description: "تغيير الاسم المستعار لكل الأعضاء في المحادثة أو الأعضاء الذين تم عمل تاج لهم بصيغة معينة",
		guide: {
			body: "   {pn} <الاسم المستعار>: تغيير اسمك المستعار\n   {pn} @تاجات <الاسم المستعار>: تغيير اسم الأعضاء الذين تم عمل تاج لهم\n   {pn} all <الاسم المستعار>: تغيير اسم كل الأعضاء في المحادثة\n\nمع الاختصارات المتاحة:\n   + {userName}: اسم العضو\n   + {userID}: آيدي العضو\n\n   مثال: (انظر الصورة)",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/setname_1.png`]: "https://i.ibb.co/gFh23zb/guide1.png",
				[`${process.cwd()}/scripts/cmds/assets/guide/setname_2.png`]: "https://i.ibb.co/BNWHKgj/guide2.png"
			}
		},
		text: {
			error: "حدث خطأ، جرّب إيقاف ميزة رابط الدعوة في المجموعة وحاول مرة أخرى لاحقًا"
		}
	},
	setrole: {
		description: "تعديل صلاحية الأمر (الأوامر ذات الصلاحية أقل من 2)",
		guide: "   {pn} <اسم الأمر> <الصلاحية الجديدة>: تحديد صلاحية جديدة للأمر\n   حيث:\n   + <اسم الأمر>: اسم الأمر\n   + <الصلاحية الجديدة>: الصلاحية الجديدة للأمر بحيث:\n   + <الصلاحية الجديدة> = 0: يمكن لكل أعضاء المجموعة استخدام الأمر\n   + <الصلاحية الجديدة> = 1: يمكن للإدمن فقط استخدام الأمر\n   + <الصلاحية الجديدة> = default: إعادة صلاحية الأمر للوضع الافتراضي\n   مثال:\n    {pn} rank 1: (أمر rank يمكن للإدمن فقط استخدامه)\n    {pn} rank 0: (أمر rank يمكن لكل الأعضاء استخدامه)\n    {pn} rank default: إعادة للوضع الافتراضي\n—————\n   {pn} [viewrole|view|show]: عرض صلاحيات الأوامر المعدّلة",
		text: {
			noEditedCommand: "✅ مجموعتك ليس بها أي أمر معدّل",
			editedCommand: "⚠️ مجموعتك بها أوامر معدّلة:\n",
			noPermission: "❗ فقط الإدمن يمكنه استخدام هذا الأمر",
			commandNotFound: "الأمر \"%1\" غير موجود",
			noChangeRole: "❗ لا يمكن تغيير صلاحية الأمر \"%1\"",
			resetRole: "تمت إعادة صلاحية الأمر \"%1\" للوضع الافتراضي",
			changedRole: "تم تغيير صلاحية الأمر \"%1\" إلى %2"
		}
	},
	setwelcome: {
		description: "تعديل محتوى رسالة الترحيب عند انضمام عضو جديد لمجموعتك",
		guide: {
			body: "   {pn} text [<المحتوى> | reset]: تعديل النص أو إعادته للوضع الافتراضي، مع بعض الاختصارات:\n  + {userName}: اسم العضو الجديد\n  + {userNameTag}: اسم العضو الجديد (كتاج)\n  + {boxName}: اسم المحادثة\n  + {multiple}: أنت || أنتم\n  + {session}: فترة اليوم\n\n   مثال:\n    {pn} text أهلاً {userName}، أهلاً بك في {boxName}، يوم سعيد {multiple}\n\n   رد على رسالة أو أرسل رسالة بملف مع المحتوى {pn} file: لإضافة مرفقات لرسالة الترحيب (صورة، فيديو، صوت)\n\n   مثال:\n    {pn} file reset: حذف المرفقات",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/setwelcome/setwelcome_en_1.png`]: "https://i.ibb.co/vsCz0ks/setwelcome-en-1.png"
			}
		},
		text: {
			missingContent: "من فضلك أدخل محتوى رسالة الترحيب",
			edited: "تم تعديل محتوى رسالة الترحيب لمجموعتك إلى: %1",
			reseted: "تمت إعادة محتوى رسالة الترحيب للوضع الافتراضي",
			noFile: "لا يوجد مرفقات لحذفها",
			resetedFile: "تم حذف المرفقات بنجاح",
			missingFile: "من فضلك رد على هذه الرسالة بملف صورة/فيديو/صوت",
			addedFile: "تمت إضافة %1 مرفق لرسالة الترحيب الخاصة بمجموعتك"
		}
	},
	shortcut: {
		description: "إضافة اختصار لرسالتك في المحادثة",
		text: {
			missingContent: 'من فضلك أدخل محتوى الرسالة',
			shortcutExists: 'الاختصار "%1" موجود بالفعل، تفاعل مع هذه الرسالة لاستبدال محتوى الاختصار',
			shortcutExistsByOther: 'الاختصار %1 تمت إضافته من عضو آخر، من فضلك جرّب كلمة أخرى',
			added: 'تمت إضافة الاختصار %1 => %2',
			addedAttachment: ' مع %1 مرفق',
			missingKey: 'من فضلك أدخل الكلمة الخاصة بالاختصار الذي تريد حذفه',
			notFound: 'لا يوجد اختصار بالكلمة %1 في مجموعتك',
			onlyAdmin: 'فقط الإدمنز يمكنهم حذف اختصارات الآخرين',
			deleted: 'تم حذف الاختصار %1',
			empty: 'مجموعتك لم تقم بإضافة أي اختصارات',
			message: 'الرسالة',
			attachment: 'المرفق',
			list: 'قائمة اختصاراتك',
			onlyAdminRemoveAll: 'فقط الإدمنز يمكنهم إزالة كل الاختصارات في المجموعة',
			confirmRemoveAll: 'هل أنت متأكد أنك تريد إزالة كل الاختصارات في هذه المجموعة؟ (تفاعل مع هذه الرسالة للتأكيد)',
			removedAll: 'تمت إزالة كل الاختصارات في مجموعتك'
		}
	},
	simsimi: {
		description: "الدردشة مع سيمسيمي",
		guide: "   {pn} [on | off]: تفعيل/تعطيل سيمسيمي\n\n   {pn} <كلمة>: الدردشة مع سيمسيمي\n   مثال:\n    {pn} hi",
		text: {
			turnedOn: "تم تفعيل سيمسيمي بنجاح!",
			turnedOff: "تم إيقاف سيمسيمي بنجاح!",
			chatting: "جاري الدردشة مع سيمسيمي...",
			error: "سيمسيمي مشغول حاليًا، من فضلك حاول مرة أخرى لاحقًا"
		}
	},
	sorthelp: {
		description: "ترتيب قائمة المساعدة",
		guide: "{pn} [name | category]",
		text: {
			savedName: "تم حفظ ترتيب قائمة المساعدة حسب الاسم",
			savedCategory: "تم حفظ ترتيب قائمة المساعدة حسب الفئة"
		}
	},
	thread: {
		description: "إدارة المحادثات في نظام البوت",
		guide: "   {pn} [find | -f | search | -s] <الاسم للبحث>: البحث عن محادثة في بيانات البوت بالاسم\n   {pn} [find | -f | search | -s] [-j | joined] <الاسم للبحث>: البحث عن محادثة لا يزال البوت منضمًا إليها بالاسم\n   {pn} [ban | -b] [<آيدي المحادثة> | اتركه فارغًا] <السبب>: لحظر محادثة بالآيدي <tid> أو المحادثة الحالية التي تستخدم البوت\n   مثال:\n    {pn} ban 3950898668362484 سبام للبوت\n    {pn} ban سبام كثير جدًا\n    {pn} unban [<آيدي المحادثة> | اتركه فارغًا] لإلغاء حظر محادثة بالآيدي أو المحادثة الحالية",
		text: {
			noPermission: "ليس لديك صلاحية لاستخدام هذه الميزة",
			found: "🔎 تم العثور على %1 محادثة تطابق الكلمة \"%3\" في بيانات البوت:\n%3",
			notFound: "❌ لا توجد محادثة تطابق الكلمة: \"%1\" في بيانات البوت",
			hasBanned: "المحادثة ذات الآيدي [%1 | %2] تم حظرها من قبل:\n» السبب: %3\n» الوقت: %4",
			banned: "تم حظر المحادثة ذات الآيدي [%1 | %2] من استخدام البوت.\n» السبب: %3\n» الوقت: %4",
			notBanned: "المحادثة ذات الآيدي [%1 | %2] غير محظورة من استخدام البوت",
			unbanned: "تم إلغاء حظر المحادثة ذات الآيدي [%1 | %2] من استخدام البوت",
			missingReason: "سبب الحظر لا يمكن أن يكون فارغًا",
			info: "» آيدي المحادثة: %1\n» الاسم: %2\n» تاريخ إنشاء البيانات: %3\n» إجمالي الأعضاء: %4\n» ذكور: %5 عضو\n» إناث: %6 عضو\n» إجمالي الرسائل: %7%8"
		}
	},
	tid: {
		description: "عرض آيدي محادثتك",
		guide: "{pn}"
	},
	tik: {
		description: "تحميل فيديو/سلايد (صور)، صوت من رابط تيك توك",
		guide: "   {pn} [video|-v|v] <الرابط>: لتحميل فيديو/سلايد (صور) من رابط تيك توك.\n   {pn} [audio|-a|a] <الرابط>: لتحميل الصوت من رابط تيك توك",
		text: {
			invalidUrl: "من فضلك أدخل رابط تيك توك صحيح",
			downloadingVideo: "جاري تحميل الفيديو: %1...",
			downloadedSlide: "تم تحميل السلايد: %1\n%2",
			downloadedVideo: "تم تحميل الفيديو: %1\nرابط التحميل: %2",
			downloadingAudio: "جاري تحميل الصوت: %1...",
			downloadedAudio: "تم تحميل الصوت: %1"
		}
	},
	trigger: {
		description: "صورة تريجر",
		guide: "{pn} [@تاج | فارغ]"
	},
	uid: {
		description: "عرض آيدي حساب الفيسبوك للمستخدم",
		guide: "   {pn}: لعرض آيدي حسابك على فيسبوك\n   {pn} @تاج: عرض آيدي فيسبوك للأشخاص الذين تم عمل تاج لهم\n   {pn} <رابط البروفايل>: عرض آيدي فيسبوك لرابط البروفايل",
		text: {
			syntaxError: "من فضلك اعمل تاج للشخص الذي تريد عرض آيديه أو اتركه فارغًا لعرض آيديك أنت"
		}
	},
	unsend: {
		description: "إلغاء إرسال رسالة البوت",
		guide: "رد على الرسالة التي تريد إلغاء إرسالها واستدعِ الأمر {pn}",
		text: {
			syntaxError: "من فضلك رد على الرسالة التي تريد إلغاء إرسالها"
		}
	},
	user: {
		description: "إدارة المستخدمين في نظام البوت",
		guide: "   {pn} [find | -f | search | -s] <الاسم للبحث>: البحث عن مستخدمين في بيانات البوت بالاسم\n\n   {pn} [ban | -b] [<آيدي المستخدم> | @تاج | رد على رسالة] <السبب>: لحظر مستخدم بالآيدي <uid> أو المستخدم الذي تم عمل تاج له أو مرسل الرسالة التي تم الرد عليها من استخدام البوت\n\n   {pn} unban [<آيدي المستخدم> | @تاج | رد على رسالة]: لإلغاء حظر مستخدم من استخدام البوت",
		text: {
			noUserFound: "❌ لا يوجد مستخدم بالاسم يطابق الكلمة: \"%1\" في بيانات البوت",
			userFound: "🔎 تم العثور على %1 مستخدم بالاسم يطابق الكلمة \"%2\" في بيانات البوت:\n%3",
			uidRequired: "آيدي المستخدم المراد حظره لا يمكن أن يكون فارغًا، من فضلك أدخل الآيدي أو اعمل تاج أو رد على رسالة شخص واحد بالأمر user ban <آيدي> <السبب>",
			reasonRequired: "سبب حظر المستخدم لا يمكن أن يكون فارغًا، من فضلك أدخل الآيدي أو اعمل تاج أو رد على رسالة شخص واحد بالأمر user ban <آيدي> <السبب>",
			userHasBanned: "المستخدم ذو الآيدي [%1 | %2] تم حظره من قبل:\n» السبب: %3\n» التاريخ: %4",
			userBanned: "تم حظر المستخدم ذو الآيدي [%1 | %2]:\n» السبب: %3\n» التاريخ: %4",
			uidRequiredUnban: "آيدي المستخدم المراد إلغاء حظره لا يمكن أن يكون فارغًا",
			userNotBanned: "المستخدم ذو الآيدي [%1 | %2] غير محظور",
			userUnbanned: "تم إلغاء حظر المستخدم ذو الآيدي [%1 | %2]"
		}
	},
	videofb: {
		description: "تحميل فيديو/ستوري من فيسبوك (عام)",
		guide: "   {pn} <رابط الفيديو/الستوري>: تحميل فيديو من فيسبوك",
		text: {
			missingUrl: "من فضلك أدخل رابط الفيديو/الستوري (العام) من فيسبوك الذي تريد تحميله",
			error: "حدث خطأ أثناء تحميل الفيديو",
			downloading: "جاري تحميل الفيديو لك",
			tooLarge: "عذرًا، لا يمكننا تحميل الفيديو لك لأن حجمه أكبر من 83 ميجابايت"
		}
	},
	warn: {
		description: "تحذير عضو في المجموعة، إذا وصل لـ 3 تحذيرات سيتم حظره",
		guide: "   {pn} @تاج <السبب>: تحذير عضو\n   {pn} list: عرض قائمة الأعضاء المحذّرين\n   {pn} listban: عرض قائمة الأعضاء المحظورين\n   {pn} info [@تاج | <آيدي> | اتركه فارغًا]: عرض معلومات التحذير للعضو أو الآيدي أو نفسك\n   {pn} unban <آيدي>: إلغاء حظر عضو بالآيدي\n   {pn} unwarn <آيدي> [<رقم التحذير> | اتركه فارغًا]: إزالة تحذير عضو بالآيدي ورقم التحذير\n   {pn} warn reset: إعادة كل بيانات التحذيرات\n⚠️ تحتاج تعيين البوت كإدمن ليطرد الأعضاء المحظورين تلقائيًا",
		text: {
			list: "قائمة الأعضاء الذين تم تحذيرهم:\n%1\n\nلعرض تفاصيل التحذيرات، استخدم الأمر \"%2warn info [@تاج | <آيدي> | اتركه فارغًا]\": لعرض معلومات تحذير الشخص أو الآيدي أو نفسك",
			listBan: "قائمة الأعضاء الذين تم تحذيرهم 3 مرات وتم حظرهم من المحادثة:\n%1",
			listEmpty: "مجموعتك لا يوجد بها أعضاء تم تحذيرهم",
			listBanEmpty: "مجموعتك لا يوجد بها أعضاء محظورين من المحادثة",
			invalidUid: "من فضلك أدخل آيدي صحيح للشخص الذي تريد عرض معلوماته",
			noData: "لا توجد بيانات",
			noPermission: "❌ فقط مشرفو المجموعة يمكنهم إلغاء حظر الأعضاء المحظورين من المحادثة",
			invalidUid2: "⚠️ من فضلك أدخل آيدي صحيح للشخص الذي تريد إلغاء حظره",
			notBanned: "⚠️ المستخدم صاحب الآيدي %1 لم يتم حظره من محادثتك",
			unbanSuccess: "✅ تم إلغاء حظر العضو [%1 | %2] بنجاح، ويمكنه الآن الانضمام لمحادثتك",
			noPermission2: "❌ فقط مشرفو المجموعة يمكنهم إزالة تحذيرات الأعضاء في المجموعة",
			invalidUid3: "⚠️ من فضلك أدخل آيدي أو اعمل تاج للشخص الذي تريد إزالة تحذيره",
			noData2: "⚠️ المستخدم صاحب الآيدي %1 لا يوجد لديه بيانات تحذير",
			notEnoughWarn: "❌ المستخدم %1 لديه فقط %2 تحذير",
			unwarnSuccess: "✅ تمت إزالة التحذير رقم %1 من العضو [%2 | %3] بنجاح",
			noPermission3: "❌ فقط مشرفو المجموعة يمكنهم إعادة بيانات التحذيرات",
			resetWarnSuccess: "✅ تمت إعادة بيانات التحذيرات بنجاح",
			noPermission4: "❌ فقط مشرفو المجموعة يمكنهم تحذير الأعضاء في المجموعة",
			invalidUid4: "⚠️ يجب عليك عمل تاج أو الرد على رسالة الشخص الذي تريد تحذيره",
			warnSuccess: "⚠️ تم تحذير العضو %1 مرات %2\n- الآيدي: %3\n- السبب: %4\n- التاريخ والوقت: %5\nتم تحذير هذا العضو 3 مرات وسيتم حظره من المحادثة، لإلغاء الحظر استخدم الأمر \"%6warn unban <آيدي>\" (حيث الآيدي هو آيدي الشخص الذي تريد إلغاء حظره)",
			noPermission5: "⚠️ البوت يحتاج صلاحيات إدمن لطرد الأعضاء المحظورين",
			warnSuccess2: "⚠️ تم تحذير العضو %1 مرات %2\n- الآيدي: %3\n- السبب: %4\n- التاريخ والوقت: %5\nإذا خالف هذا الشخص %6 مرات أخرى سيتم حظره من المحادثة",
			hasBanned: "⚠️ الأعضاء التاليون تم تحذيرهم 3 مرات من قبل وتم حظرهم من المحادثة:\n%1",
			failedKick: "⚠️ حدث خطأ أثناء طرد الأعضاء التاليين:\n%1"
		}
	},
	weather: {
		description: "عرض حالة الطقس الحالية وتوقعات الأيام الـ5 القادمة",
		guide: "{pn} <الموقع>",
		text: {
			syntaxError: "من فضلك أدخل موقعًا",
			notFound: "لم يتم العثور على الموقع: %1",
			error: "حدث خطأ: %1",
			today: "طقس اليوم:\n%1\n🌡 درجة الحرارة الصغرى - الكبرى %2°م - %3°م\n🌡 يبدو وكأنه %4°م - %5°م\n🌅 الشروق %6\n🌄 الغروب %7\n🌃 شروق القمر %8\n🏙️ غروب القمر %9\n🌞 النهار: %10\n🌙 الليل: %11"
		}
	},
	ytb: {
		description: "تحميل فيديو، صوت أو عرض معلومات فيديو من يوتيوب",
		guide: "   {pn} [video|-v] [<اسم الفيديو>|<رابط الفيديو>]: لتحميل فيديو من يوتيوب.\n   {pn} [audio|-a] [<اسم الفيديو>|<رابط الفيديو>]: لتحميل صوت من يوتيوب\n   {pn} [info|-i] [<اسم الفيديو>|<رابط الفيديو>]: لعرض معلومات فيديو من يوتيوب\n   مثال:\n    {pn} -v Fallen Kingdom\n    {pn} -a Fallen Kingdom\n    {pn} -i Fallen Kingdom",
		text: {
			error: "حدث خطأ: %1",
			noResult: "لا توجد نتائج بحث تطابق الكلمة %1",
			choose: "%1رد على الرسالة بالرقم للاختيار أو أي محتوى آخر للإلغاء",
			downloading: "جاري تحميل الفيديو %1",
			noVideo: "عذرًا، لم يتم العثور على فيديو بحجم أقل من 83 ميجابايت",
			downloadingAudio: "جاري تحميل الصوت %1",
			noAudio: "عذرًا، لم يتم العثور على صوت بحجم أقل من 26 ميجابايت",
			info: "💠 العنوان: %1\n🏪 القناة: %2\n👨‍👩‍👧‍👦 المشتركين: %3\n⏱ مدة الفيديو: %4\n👀 المشاهدات: %5\n👍 الإعجابات: %6\n🆙 تاريخ الرفع: %7\n🔠 الآيدي: %8\n🔗 الرابط: %9",
			listChapter: "\n📖 قائمة الفصول: %1\n"
		}
	}
};
